yii2Task1/frontend/models/Company.php

SELECT * FROM `companies`
---
    public function getRandomCompanyID() {
        $companies = Company::find()->asArray()->all();